
if __name__ == '__main__':
    text = '''
    ನವದೆಹಲಿ: ಕಳೆದ ವಾರ ನಡೆದ ಎರಡನೇ ಶೆರ್ಪಾಸ್ ಸಭೆಯಲ್ಲಿ ಪಾಲ್ಗೊಳ್ಳಲು ಸೌದಿ ಅರೇಬಿಯಾಕ್ಕೆ ಹೋಗಿದ್ದ ಬಿಜೆಪಿ ಸಂಸದ ಸುರೇಶ್ ಪ್ರಭು ಭಾರತಕ್ಕೆ ಮರಳಿ ಬಂದ ನಂತರ ಕೊರೋನಾ ವೈರಸ್ ಪರೀಕ್ಷೆಯನ್ನು ಸಹ ಮಾಡಿಸಿಕೊಂಡಿದ್ದರು. ಪರೀಕ್ಷೆಯಲ್ಲಿ ಅವರಲ್ಲಿ ಕೊರೋನಾ ಸೋಂಕು ಇಲ್ಲ ಎಂದು ದೃಢವಾಗಿದೆ. ಆದರೂ ಸಹ ಮುಂಜಾಗ್ರತ ಕ್ರಮವಾಗಿ ಸ್ವ ಇಚ್ಛೆಯಿಂದ ಮನೆಯಲ್ಲಿಯೇ 14
    ಚೀನಾದಲ್ಲಿ 3,200 ಜನರನ್ನು ಹಾಗೂ ವಿಶ್ವದಾದ್ಯಂತ ಸುಮಾರು 8,000  ಜನರನ್ನು ಬಲಿ ಪಡೆದ ಕೊರೋನಾ ವೈರಸ್ ಭಾರತದಲ್ಲೂ ತನ್ನ ಅಟ್ಟಹಾಸ ಮುಂದುವರಿಸಿದೆ. ಈಗಾಗಲೇ ಭಾರತದಲ್ಲಿ ಮೂವರು ಸಾವನ್ನಪ್ಪಿದ್ದು, 147 ಜನರು ಸೋಂಕಿತರಾಗಿದ್ದಾರೆ. ಕರ್ನಾಟಕದಲ್ಲಿ ಈಗಾಗಲೇ ಮುಂಜಾಗ್ರತಾ ಕ್ರಮವಾಗಿ ಒಂದು ವಾರ ಬಂದ್ ಘೋಷಿಸಲಾಗಿತ್ತು. ಕೊರೋನಾ ಹರಡುವಿಕೆ ತಹಬಂದಿಗೆ ಬರದ ಕಾರಣ ಬಂದ್ ಕಾಲಾವಧಿಯನ್ನು ಮತ್ತೂ ಒಂದು ವಾರ ಮುಂದುವರೆಸಲು ಸಿಎಂ ಬಿಎಸ್ ಯಡಿಯೂರಪ್ಪ ಚಿಂತನೆ ನಡೆಸಿದ್ದಾರೆ. ಈ ಬಗ್ಗೆ ಕ್ಷಣ ಕ್ಷಣದ ಮಾಹಿತಿ ನ್ಯೂಸ್ ಕನ್ನಡದಲ್ಲಿ.
    ಕಳೆದ ವಾರ ನಡೆದ
    '''
    summary = luhn_summarize(text)
    print(summary)
